#include <iostream>
using namespace std;
int main()
{
	int number;
	cout << "number:";
	cin >> number;
	//Размерите на квадрата
	char symbol;
	//Това е тип данна, която представлява символ, но ще говорим повече за тях нататък
	//Засега ви стига просто, за да въведете char, е по същия начин като число, само че може да е какъвто символ си изберете от клавиатурата

	cout << "symbol:";
	cin >> symbol;

	//Имаме един външен цикъл, който служи за смяна на нивата на квадрата (от 1 до n)
	//и един вътрешен цикъл, който служи за обхождане на нивото на квадрата, на което се намираме (тоест стъпката от външния цикъл)
		//Може да разглеждате квадрата и като квадратна матрица, където външният цикъл я обхожда по редове, а вътрешният - по стълбове.

	for (int i = 0; i < number; i++)
	{
		if (i == 0 || i == number - 1)//Ако се намираме на горната стена или долната стена на квадрата
		{
			for (int j = 0; j < number; j++)
			{
				cout << " * ";
				//отпечатваме цялата горна или долна страна със симовла "*"
			}
		}
		else
			//Ако сме във сътрешноста на квадрата, тоест всяко друго ниво без горната и долната страна
		{
			for (int j = 0; j < number; j++)
			{
				if (j == 0 || j == number - 1) //По този начин отпечатваме лявата и дясната страна, тъй като можем да ги запълним или в началото, или в края на цикъла
				{
					cout << " * ";
				}
				else
				{
					cout << symbol << " "; //Тук вече запълваме вътрешността на квадрата с избрания от нас символ (char a)
				}
			}
		}

		cout << endl;
	}
}